In [5]:
import pandas as pd

In [6]:
dict1={
    'Name':['Ashish','Rohit','Surbhi','Aadhya','Vedant','Harsh','Priyanka'],
    'Marks':[98,89,99,87,90,83,99],
    'Gender':['Male','Male','Female','Female','Male','Male','Female']
}
df1=pd.DataFrame(dict1)
df1

       Name  Marks  Gender
0    Ashish     98    Male
1     Rohit     89    Male
2    Surbhi     99  Female
3    Aadhya     87  Female
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

# 1. Display Top 3 Rows of The Dataset

In [7]:
df1.head()

     Name  Marks  Gender
0  Ashish     98    Male
1   Rohit     89    Male
2  Surbhi     99  Female
3  Aadhya     87  Female
4  Vedant     90    Male

# 2.Check Last 3 Rows of the Dataset

In [8]:
df1.tail(3)

       Name  Marks  Gender
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

# 3 Find Shape of Our Dataset(Number of Rows and Columns)

In [9]:
df1.shape

(7, 3)

In [13]:
print('Number of Rows',df1.shape[0])
print('Number of Column',df1.shape[1])

Number of Rows 7
Number of Column 3


# 4 Get information About Our Dataset Like Total Number Rows,Total Number of Columns, Datatypes of each column and Memory Reqirement

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

#  5.Check Null Values in the DataSet

In [28]:
df1.isnull()
df1.isnull().sum(axis=0)
df1.isnull().sum(axis=1) # row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6. Get overall Statistics About The DataFrame

In [30]:
df1.describe(include='all')

          Name      Marks Gender
count        7   7.000000      7
unique       7        NaN      2
top     Surbhi        NaN   Male
freq         1        NaN      4
mean       NaN  92.142857    NaN
std        NaN   6.491753    NaN
min        NaN  83.000000    NaN
25%        NaN  88.000000    NaN
50%        NaN  90.000000    NaN
75%        NaN  98.500000    NaN
max        NaN  99.000000    NaN

# 7. Find Unique Values From The Gender Column

In [31]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8.Find the number of Unique Values From The Gender Column

In [32]:
df1['Gender'].nunique()

2

# 9. Display count of unique values in gender column

In [37]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

# 10.Find Total number of students Having Marks Between 90 To 100 (inclusive) Using Between Method

In [38]:
df1[df1['Marks']>=90]

       Name  Marks  Gender
0    Ashish     98    Male
2    Surbhi     99  Female
4    Vedant     90    Male
6  Priyanka     99  Female

In [42]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [43]:
sum(df1['Marks'].between(90,100))

4

# 11.Find Average Marks

In [44]:
df1

       Name  Marks  Gender
0    Ashish     98    Male
1     Rohit     89    Male
2    Surbhi     99  Female
3    Aadhya     87  Female
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

In [45]:
df1['Marks'].mean()

92.14285714285714

In [46]:
df1['Marks'].min()

83

# 12.Apply Method

In [54]:
def marks(x):
    return x//2

In [55]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [56]:
df1['Half_marks']=df1['Marks'].apply(marks)
df1

       Name  Marks  Gender  Half_marks
0    Ashish     98    Male          49
1     Rohit     89    Male          44
2    Surbhi     99  Female          49
3    Aadhya     87  Female          43
4    Vedant     90    Male          45
5     Harsh     83    Male          41
6  Priyanka     99  Female          49

In [57]:
# Using Lambda Function

df1['Half_marks']=df1['Marks'].apply(marks)
df1

       Name  Marks  Gender  Half_marks
0    Ashish     98    Male          49
1     Rohit     89    Male          44
2    Surbhi     99  Female          49
3    Aadhya     87  Female          43
4    Vedant     90    Male          45
5     Harsh     83    Male          41
6  Priyanka     99  Female          49

In [58]:
df1['Name'].apply(len)

0    6
1    5
2    6
3    6
4    6
5    5
6    8
Name: Name, dtype: int64

# 13.Map Function

In [59]:
df1

       Name  Marks  Gender  Half_marks
0    Ashish     98    Male          49
1     Rohit     89    Male          44
2    Surbhi     99  Female          49
3    Aadhya     87  Female          43
4    Vedant     90    Male          45
5     Harsh     83    Male          41
6  Priyanka     99  Female          49

In [70]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

       Name  Marks  Gender  Half_marks  Male_Female
0    Ashish     98    Male          49            1
1     Rohit     89    Male          44            1
2    Surbhi     99  Female          49            0
3    Aadhya     87  Female          43            0
4    Vedant     90    Male          45            1
5     Harsh     83    Male          41            1
6  Priyanka     99  Female          49            0

# 14.Drop the column

In [71]:
df1

       Name  Marks  Gender  Half_marks  Male_Female
0    Ashish     98    Male          49            1
1     Rohit     89    Male          44            1
2    Surbhi     99  Female          49            0
3    Aadhya     87  Female          43            0
4    Vedant     90    Male          45            1
5     Harsh     83    Male          41            1
6  Priyanka     99  Female          49            0

In [72]:
df1.drop('Male_Female',axis=1)

       Name  Marks  Gender  Half_marks
0    Ashish     98    Male          49
1     Rohit     89    Male          44
2    Surbhi     99  Female          49
3    Aadhya     87  Female          43
4    Vedant     90    Male          45
5     Harsh     83    Male          41
6  Priyanka     99  Female          49

In [74]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True) #Use inplace=True(if we want to modify existing dataframe)
df1

       Name  Marks  Gender
0    Ashish     98    Male
1     Rohit     89    Male
2    Surbhi     99  Female
3    Aadhya     87  Female
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

# 15.Print the name of the column

In [75]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [76]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# 16.Sort the dataframe As per the marks column

In [77]:
df1

       Name  Marks  Gender
0    Ashish     98    Male
1     Rohit     89    Male
2    Surbhi     99  Female
3    Aadhya     87  Female
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

In [78]:
df1.sort_values(by='Marks')

       Name  Marks  Gender
5     Harsh     83    Male
3    Aadhya     87  Female
1     Rohit     89    Male
4    Vedant     90    Male
0    Ashish     98    Male
2    Surbhi     99  Female
6  Priyanka     99  Female

In [80]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

       Name  Marks  Gender
2    Surbhi     99  Female
6  Priyanka     99  Female
0    Ashish     98    Male
4    Vedant     90    Male
1     Rohit     89    Male
3    Aadhya     87  Female
5     Harsh     83    Male

# 17.Display the Names and Marks of Female student

In [81]:
df1

       Name  Marks  Gender
0    Ashish     98    Male
1     Rohit     89    Male
2    Surbhi     99  Female
3    Aadhya     87  Female
4    Vedant     90    Male
5     Harsh     83    Male
6  Priyanka     99  Female

In [84]:
df1[df1['Gender']=='Female']

       Name  Marks  Gender
2    Surbhi     99  Female
3    Aadhya     87  Female
6  Priyanka     99  Female

In [85]:
df1[df1['Gender']=='Female'] [['Name','Marks']]

       Name  Marks
2    Surbhi     99
3    Aadhya     87
6  Priyanka     99

In [86]:
#second method
df1[df1['Gender'].isin(['Female'])] [['Name','Marks']]

       Name  Marks
2    Surbhi     99
3    Aadhya     87
6  Priyanka     99